PythonForDataAnalysis_DataCleaning

In [1]:
import numpy as np
import pandas as pd

In [2]:
float_data = pd.Series([1.2,-3.5,np.nan,0])

In [3]:
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [4]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
# None value is treated as na 
string_data = pd.Series(["aardvark",np.nan,None,"avocado"])

In [6]:
string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [7]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [8]:
float_data = pd.Series([1,2,None],dtype ='float64')

In [9]:
float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [10]:
float_data.isna()

0    False
1    False
2     True
dtype: bool

Filtering Out Missing Data

In [11]:
data = pd.Series([1,np.nan,3.5,np.nan,7])

In [12]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [13]:
# dropna() to drop the na values
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [14]:
data = pd.DataFrame([[1.,6.5,3.],[1,np.nan,np.nan],[np.nan,np.nan,np.nan],[np.nan,6.5,3]])

In [15]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [17]:
# passsing how = all for only delete the rows that have all na values
data.dropna(how = "all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [18]:
data[4] = np.nan

In [19]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [20]:
# dropping the coulmns that have all na values
data.dropna(axis = "columns", how = "all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [21]:
df = pd.DataFrame(np.random.standard_normal((7,3)))

In [22]:
df

          0         1         2
0  0.850207 -1.092494  1.002334
1 -1.097233 -1.224922  0.397866
2  0.014784  2.298523 -0.025337
3 -1.820809 -0.637999 -1.027949
4 -1.632713 -0.636024  0.556863
5  0.514200 -0.347643  0.837459
6  0.616196  0.338077  0.376084

In [23]:
df.iloc[:4,1] = np.nan

In [24]:
df

          0         1         2
0  0.850207       NaN  1.002334
1 -1.097233       NaN  0.397866
2  0.014784       NaN -0.025337
3 -1.820809       NaN -1.027949
4 -1.632713 -0.636024  0.556863
5  0.514200 -0.347643  0.837459
6  0.616196  0.338077  0.376084

In [25]:
df.iloc[:2,2] = np.nan

In [26]:
df

          0         1         2
0  0.850207       NaN       NaN
1 -1.097233       NaN       NaN
2  0.014784       NaN -0.025337
3 -1.820809       NaN -1.027949
4 -1.632713 -0.636024  0.556863
5  0.514200 -0.347643  0.837459
6  0.616196  0.338077  0.376084

In [27]:
df.dropna()

          0         1         2
4 -1.632713 -0.636024  0.556863
5  0.514200 -0.347643  0.837459
6  0.616196  0.338077  0.376084

In [28]:
df.dropna(thresh=2)

          0         1         2
2  0.014784       NaN -0.025337
3 -1.820809       NaN -1.027949
4 -1.632713 -0.636024  0.556863
5  0.514200 -0.347643  0.837459
6  0.616196  0.338077  0.376084

Filling in Missing Data

In [29]:
# fill the data in nan
df.fillna(0)

          0         1         2
0  0.850207  0.000000  0.000000
1 -1.097233  0.000000  0.000000
2  0.014784  0.000000 -0.025337
3 -1.820809  0.000000 -1.027949
4 -1.632713 -0.636024  0.556863
5  0.514200 -0.347643  0.837459
6  0.616196  0.338077  0.376084

In [30]:
# using fill na different values with help of dictionary
df.fillna({1:0.5,2:0})

          0         1         2
0  0.850207  0.500000  0.000000
1 -1.097233  0.500000  0.000000
2  0.014784  0.500000 -0.025337
3 -1.820809  0.500000 -1.027949
4 -1.632713 -0.636024  0.556863
5  0.514200 -0.347643  0.837459
6  0.616196  0.338077  0.376084

In [31]:
df = pd.DataFrame(np.random.standard_normal((6,3)))
df

          0         1         2
0 -0.017595  0.026051  0.098413
1 -1.265744 -1.017466 -0.119380
2  0.258952 -1.403697 -2.429669
3  1.502499 -1.478918 -1.221501
4  0.620313  1.198004  1.495104
5  0.346512 -1.041467  0.667643

In [32]:
df.iloc[2:,1] = np.nan
df

          0         1         2
0 -0.017595  0.026051  0.098413
1 -1.265744 -1.017466 -0.119380
2  0.258952       NaN -2.429669
3  1.502499       NaN -1.221501
4  0.620313       NaN  1.495104
5  0.346512       NaN  0.667643

In [33]:
df.iloc[4:,2] = np.nan

In [34]:
df

          0         1         2
0 -0.017595  0.026051  0.098413
1 -1.265744 -1.017466 -0.119380
2  0.258952       NaN -2.429669
3  1.502499       NaN -1.221501
4  0.620313       NaN       NaN
5  0.346512       NaN       NaN

In [35]:
df.ffill()

          0         1         2
0 -0.017595  0.026051  0.098413
1 -1.265744 -1.017466 -0.119380
2  0.258952 -1.017466 -2.429669
3  1.502499 -1.017466 -1.221501
4  0.620313 -1.017466 -1.221501
5  0.346512 -1.017466 -1.221501

In [36]:
df.ffill(limit =2)

          0         1         2
0 -0.017595  0.026051  0.098413
1 -1.265744 -1.017466 -0.119380
2  0.258952 -1.017466 -2.429669
3  1.502499 -1.017466 -1.221501
4  0.620313       NaN -1.221501
5  0.346512       NaN -1.221501

In [37]:
data = pd.Series([1.,np.nan,3.5,np.nan,7])

In [38]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [39]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

Data Transformation

In [40]:
data = pd.DataFrame({"k1": ["one","two"]*3 + ["two"],"k2" : [1,1,2,3,3,4,4]})

In [41]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [42]:
# show boolean series indicating whether each row is duplicate (compare with above rows)
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [43]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [44]:
data["v1"] = range(7)

In [45]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [46]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [47]:
data.drop_duplicates(subset= ["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [48]:
data.drop_duplicates(["k1","k2"],keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

Transforming Data Using a Function or Mapping

In [49]:
data = pd.DataFrame({
    "food": ["bacon", "pulled pork", "bacon", "pastrami", "corned beef", 
             "bacon", "pastrami", "honey ham", "nova lox"],
    "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]
})

In [50]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

Replacing Values

In [51]:
data = pd.Series([1.,-999.,2.,-999.,-1000.,3.])

In [52]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [53]:
# replace() 
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [54]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [55]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

Renaming Axis Indexes

In [56]:
data = pd.DataFrame(np.arange(12.).reshape((3,4)),index = ["Melbourne", "Sydney","Darwin"], columns = ["one","two","three","four"])

In [57]:
data

           one  two  three  four
Melbourne  0.0  1.0    2.0   3.0
Sydney     4.0  5.0    6.0   7.0
Darwin     8.0  9.0   10.0  11.0

In [58]:
def transform(x):
    return x[:4].upper()

In [59]:
data.index.map(transform)

Index(['MELB', 'SYDN', 'DARW'], dtype='object')

In [60]:
data

           one  two  three  four
Melbourne  0.0  1.0    2.0   3.0
Sydney     4.0  5.0    6.0   7.0
Darwin     8.0  9.0   10.0  11.0

In [61]:
data.index = data.index.map(transform)

In [62]:
data

      one  two  three  four
MELB  0.0  1.0    2.0   3.0
SYDN  4.0  5.0    6.0   7.0
DARW  8.0  9.0   10.0  11.0

In [63]:
# For rename index
data.rename(index = str.title, columns = str.upper)

      ONE  TWO  THREE  FOUR
Melb  0.0  1.0    2.0   3.0
Sydn  4.0  5.0    6.0   7.0
Darw  8.0  9.0   10.0  11.0

Discretization and Bining
Discretization - dividing data into finite number or bins
bins -  contains fixed range of values

In [64]:
ages = [20,22,25,27,21,23,37,31,61,45,41,32]

In [65]:
bins = [18,25,35,60,100]

In [66]:
age_categories = pd.cut(ages,bins)

In [67]:
age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [68]:
age_categories.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [69]:
age_categories.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [70]:
age_categories.categories[0]

Interval(18, 25, closed='right')

In [71]:
pd.value_counts(age_categories)

C:\Users\User\AppData\Local\Temp\ipykernel_2776\3010498523.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(age_categories)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [72]:
pd.cut(ages, bins, right = False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [73]:
group_names = ["Youth","YoungAdult","MiddleAged","Senior"]

In [74]:
# passing labels as group_names
pd.cut(ages,bins,labels = group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [75]:
data = np.random.uniform(size=20)

In [76]:
data

array([0.76255362, 0.63357936, 0.43531072, 0.79723168, 0.0699347 ,
       0.33412145, 0.93625156, 0.92994293, 0.21524296, 0.6544641 ,
       0.82520909, 0.77086867, 0.94793966, 0.13222561, 0.43324289,
       0.57867537, 0.55560493, 0.52374074, 0.1483916 , 0.85902663])

In [77]:
# precision limits to number with 2 decimal places
pd.cut(data,4,precision=2)

[(0.73, 0.95], (0.51, 0.73], (0.29, 0.51], (0.73, 0.95], (0.069, 0.29], ..., (0.51, 0.73], (0.51, 0.73], (0.51, 0.73], (0.069, 0.29], (0.73, 0.95]]
Length: 20
Categories (4, interval[float64, right]): [(0.069, 0.29] < (0.29, 0.51] < (0.51, 0.73] < (0.73, 0.95]]

In [78]:
data = np.random.standard_normal(1000)

In [82]:
# qcut uses to make bins of same quantities
quartiles = pd.qcut(data,4,precision=2)

In [83]:
quartiles

[(-3.0799999999999996, -0.66], (-3.0799999999999996, -0.66], (-0.012, 0.61], (-3.0799999999999996, -0.66], (0.61, 3.04], ..., (-3.0799999999999996, -0.66], (-0.012, 0.61], (-0.012, 0.61], (0.61, 3.04], (-0.66, -0.012]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.0799999999999996, -0.66] < (-0.66, -0.012] < (-0.012, 0.61] < (0.61, 3.04]]

In [287]:
quartiles.value_counts()

(-3.0799999999999996, -0.66]    250
(-0.66, -0.012]                 250
(-0.012, 0.61]                  250
(0.61, 3.04]                    250
Name: count, dtype: int64

Detecting and Filtering Outliers

In [85]:
data = pd.DataFrame(np.random.standard_normal((1000,4)))

In [86]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.024290    -0.046573     0.011014    -0.030278
std       1.029050     0.992976     0.972949     0.970616
min      -2.957743    -3.244879    -3.332691    -2.880263
25%      -0.657359    -0.737965    -0.645513    -0.654768
50%       0.022363    -0.007481     0.018461    -0.052404
75%       0.702969     0.626088     0.647884     0.640659
max       4.131459     3.591107     3.077073     3.563606

In [87]:
# finding columns exceding absoulte value
col = data[1]

In [88]:
col[col.abs()>3]

269    3.591107
712   -3.244879
Name: 1, dtype: float64

In [89]:
# selecting all rows that have exceding value of 3 0r -3 using any method
data[(data.abs()>3).any(axis="columns")]

            0         1         2         3
67   3.264244 -0.833589  0.782594 -2.084939
148  2.209339 -0.081672  0.459722  3.015289
210  4.131459  0.861350  0.677937  1.229997
253 -1.037520 -0.947170  0.909034  3.354538
269  0.352145  3.591107 -0.638640  0.987029
296 -0.214234  0.125983 -3.332691  0.486642
302  3.230115 -1.443169  1.312075 -1.378505
349  3.215808  1.100448  0.369992  1.089399
439  0.565537  1.800340  0.216782  3.563606
462  3.218568  0.127230 -0.325209 -0.009741
467 -0.513152 -0.134391  3.077073  0.591015
548 -0.797906 -1.695712  0.945179  3.123413
712 -0.688280 -3.244879 -1.050871  1.983879
902  3.052936 -0.544362  0.858327 -0.820722

In [90]:
# np.sign return 1,0 or -1 depending on sign +,0 and -
data[data.abs() >3] = np.sign(data) * 3

In [91]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.022177    -0.046920     0.011270    -0.031335
std       1.022179     0.990221     0.971621     0.967070
min      -2.957743    -3.000000    -3.000000    -2.880263
25%      -0.657359    -0.737965    -0.645513    -0.654768
50%       0.022363    -0.007481     0.018461    -0.052404
75%       0.702969     0.626088     0.647884     0.640659
max       3.000000     3.000000     3.000000     3.000000

In [92]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0  1.0 -1.0
1 -1.0  1.0  1.0 -1.0
2 -1.0 -1.0  1.0  1.0
3 -1.0  1.0  1.0  1.0
4 -1.0  1.0 -1.0 -1.0

Permutation and Random Sampling

In [93]:
df = pd.DataFrame(np.arange(5*7).reshape((5,7)))

In [94]:
df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [95]:
sampler = np.random.permutation(5)

In [96]:
sampler

array([3, 1, 0, 4, 2], dtype=int32)

In [97]:
# Arranging row based on sampler in dataset
df.take(sampler)

    0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
1   7   8   9  10  11  12  13
0   0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
2  14  15  16  17  18  19  20

In [98]:
df.iloc[sampler]

    0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
1   7   8   9  10  11  12  13
0   0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
2  14  15  16  17  18  19  20

In [99]:
column_sampler = np.random.permutation(7)

In [100]:
column_sampler

array([5, 4, 1, 2, 0, 3, 6], dtype=int32)

In [101]:
# by passing axis = columns we select permutation of columns
df.take(column_sampler, axis = "columns")

    5   4   1   2   0   3   6
0   5   4   1   2   0   3   6
1  12  11   8   9   7  10  13
2  19  18  15  16  14  17  20
3  26  25  22  23  21  24  27
4  33  32  29  30  28  31  34

In [102]:
# taking sample from dataframe
df.sample(n=3)

    0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
3  21  22  23  24  25  26  27
0   0   1   2   3   4   5   6

In [103]:
choices = pd.Series([5,7,-1,6,4])

In [104]:
choices.sample(n=10, replace=True)

4    4
3    6
1    7
0    5
4    4
1    7
4    4
1    7
1    7
2   -1
dtype: int64

Computing Indicator/Dummy Variable

Converting categorical variable into dummy or indicator matrix
If we have k distict value, we would get k columns contaning 1 and 0s

In [105]:
df = pd.DataFrame({'key':["b","b","a","c","a","b"],
                   "data1" : range(6)})

In [106]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [107]:
# get.dummies() to convert dummy 
pd.get_dummies(df['key'])

       a      b      c
0  False   True  False
1  False   True  False
2   True  False  False
3  False  False   True
4   True  False  False
5  False   True  False

In [108]:
# Adding prefix in dummies
dummies = pd.get_dummies(df["key"],prefix = "key")

In [109]:
df_with_dummy = df[["data1"]].join(dummies)

In [110]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0  False   True  False
1      1  False   True  False
2      2   True  False  False
3      3  False  False   True
4      4   True  False  False
5      5  False   True  False

In [111]:
mnames = ["movie_id","title","genres"]

In [112]:
movies = pd.read_table(r"D:\PythonForDataAnalysis\movies.dat",sep ="::", header = None, names = mnames, engine ="python")

In [113]:
movies.head()

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

In [114]:
movies.head(10)

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [115]:
dummies = movies["genres"].str.get_dummies("|")

In [116]:
dummies.iloc[:10,:6]

   Action  Adventure  Animation  Children's  Comedy  Crime
0       0          0          1           1       1      0
1       0          1          0           1       0      0
2       0          0          0           0       1      0
3       0          0          0           0       1      0
4       0          0          0           0       1      0
5       1          0          0           0       0      1
6       0          0          0           0       1      0
7       0          1          0           1       0      0
8       1          0          0           0       0      0
9       1          1          0           0       0      0

In [117]:
dummies

,Action,Adventure,Animation,Children's,Comedy,Crime,Documentary,Drama,Fantasy,Film-Noir,Horror,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,0,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0
1,0,1,0,1,0,0,0,0,1,0,0,0,0,0,0,0,0,0
2,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0
3,0,0,0,0,1,0,0,1,0,0,0,0,0,0,0,0,0,0
4,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0
3879,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0
3880,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0
3881,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0
3882,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0

In [118]:
movies_windic = movies.join(dummies.add_prefix("Genre_"))

In [119]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Action                                   0
Genre_Adventure                                0
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Crime                                    0
Genre_Documentary                              0
Genre_Drama                                    0
Genre_Fantasy                                  0
Genre_Film-Noir                                0
Genre_Horror                                   0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Romance                                  0
Genre_Sci-Fi                                   0
Genre_Thriller                                 0
Genre_War                                      0
Genre_Western                                  0
Name: 0, dtype: object

In [120]:
np.random.seed(12345)

In [121]:
values = np.random.uniform(size=10)

In [122]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [123]:
bins = [0,0.2,0.4,0.6,0.8,1]

In [124]:
pd.get_dummies(pd.cut(values,bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0       False       False       False       False        True
1       False        True       False       False       False
2        True       False       False       False       False
3       False        True       False       False       False
4       False       False        True       False       False
5       False       False        True       False       False
6       False       False       False       False        True
7       False       False       False        True       False
8       False       False       False        True       False
9       False       False       False        True       False

Extension Data Types

In [125]:
s = pd.Series([1,2,3,None])

In [126]:
s

0    1.0
1    2.0
2    3.0
3    NaN
dtype: float64

In [127]:
s.dtype

dtype('float64')

In [128]:
# making data type Int64Dtype()
s = pd.Series([1,2,3,None], dtype = pd.Int64Dtype())

In [129]:
s

0       1
1       2
2       3
3    <NA>
dtype: Int64

In [130]:
s.isna()

0    False
1    False
2    False
3     True
dtype: bool

In [131]:
s = pd.Series(['one','two',None,'three'], dtype = pd.StringDtype())

In [132]:
s

0      one
1      two
2     <NA>
3    three
dtype: string

In [133]:
df = pd.DataFrame({'A' : [1,2,None,4],
                   'B' : ["one","two","three",None],
                   'C' : [False,None,False,True]})

In [134]:
df

     A      B      C
0  1.0    one  False
1  2.0    two   None
2  NaN  three  False
3  4.0   None   True

In [135]:
# astype to define data types
df["A"] = df["A"].astype("Int64")

In [136]:
df["B"] = df["B"].astype("string")

In [137]:
df ["C"] = df["C"].astype("boolean")

In [138]:
df

      A      B      C
0     1    one  False
1     2    two   <NA>
2  <NA>  three  False
3     4   <NA>   True

String Mainpulation

In [139]:
val = "a,b, guido"

In [140]:
val.split(",")

['a', 'b', ' guido']

In [141]:
pieces = [x.strip() for x in val.split(",")]

In [142]:
pieces

['a', 'b', 'guido']

In [143]:
first, second, third = pieces

In [144]:
first + "::" + second + "::" + third

'a::b::guido'

In [145]:
"::".join(pieces)

'a::b::guido'

In [146]:
"guido" in val

True

In [147]:
val.index(",")

1

In [148]:
val.find(":")

-1

Regular Expression
Flexiible way to find string pattern in text

In [149]:
import re
# re module helps to pattern matching, subsitute and splitting

In [150]:
text = "foo bar\t baz  \tqux"

In [151]:
re.split(r"\s+", text)

['foo', 'bar', 'baz', 'qux']

In [154]:
regex = re.compile(r"\s+")

In [155]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [157]:
# for patterns
regex.findall(text)

[' ', '\t ', '  \t']

In [158]:
text = """Anush anush@google.com
Anush anushgiri72@gmail.com
fug Fugitivecos43@gmail.com
Giri giriyahoo.com"""
pattern = r"[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}"

In [160]:
#re.IGNORECASE makes the regex case insensitive
regex = re.compile(pattern, flags= re.IGNORECASE)

In [161]:
regex.findall(text)

['anush@google.com', 'anushgiri72@gmail.com', 'Fugitivecos43@gmail.com']

In [162]:
m = regex.search(text)

In [163]:
m

In [164]:
text[m.start():m.end()]

'anush@google.com'

In [165]:
print(regex.match(text))

None

In [166]:
print(regex.sub("Hello",text))

Anush Hello
Anush Hello
fug Hello
Giri giriyahoo.com

In [167]:
regex = re.compile(pattern, flags = re.IGNORECASE)

In [168]:
m = regex.match("anush@bright.net")

In [169]:
m.groups()

()

String Functions in pandas

In [170]:
data = {"Anush" : "anushgiri72@gmail.com", "giri": "Giri72@gmail.com", "a":"a@gmail.com","b":np.nan}

In [171]:
data = pd.Series(data)

In [172]:
data

Anush    anushgiri72@gmail.com
giri          Giri72@gmail.com
a                  a@gmail.com
b                          NaN
dtype: object

In [173]:
data.isna()

Anush    False
giri     False
a        False
b         True
dtype: bool

In [174]:
data.str.contains("gmail")

Anush    True
giri     True
a        True
b         NaN
dtype: object

In [175]:
data_as_string_ext = data.astype('string')

In [176]:
data_as_string_ext

Anush    anushgiri72@gmail.com
giri          Giri72@gmail.com
a                  a@gmail.com
b                         <NA>
dtype: string

In [177]:
data_as_string_ext.str.contains("gmail")

Anush    True
giri     True
a        True
b        <NA>
dtype: boolean

In [178]:
 pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"

In [179]:
data.str.findall(pattern, flags=re.IGNORECASE)

Anush    [(anushgiri72, gmail, com)]
giri          [(Giri72, gmail, com)]
a                  [(a, gmail, com)]
b                                NaN
dtype: object

In [180]:
# makes tuples
matches = data.str.findall(pattern,flags=re.IGNORECASE).str[0]

In [181]:
matches

Anush    (anushgiri72, gmail, com)
giri          (Giri72, gmail, com)
a                  (a, gmail, com)
b                              NaN
dtype: object

In [182]:
# getting items from list
matches.str.get(1)

Anush    gmail
giri     gmail
a        gmail
b          NaN
dtype: object

In [183]:
data.str[:5]

Anush    anush
giri     Giri7
a        a@gma
b          NaN
dtype: object

In [184]:
data.str.extract(pattern, flags = re.IGNORECASE)

                 0      1    2
Anush  anushgiri72  gmail  com
giri        Giri72  gmail  com
a                a  gmail  com
b              NaN    NaN  NaN

Categorical Data

In [185]:
values = pd.Series(['apple','orange','apple','apple']*2)

In [186]:
values

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
dtype: object

In [188]:
pd.unique(values)

array(['apple', 'orange'], dtype=object)

In [190]:
values.value_counts()

apple     6
orange    2
Name: count, dtype: int64

In [191]:
values = pd.Series([0,1,0,0]*2)

In [192]:
dim = pd.Series(['apple','orange'])

In [193]:
values

0    0
1    1
2    0
3    0
4    0
5    1
6    0
7    0
dtype: int64

In [194]:
dim

0     apple
1    orange
dtype: object

In [195]:
dim.take(values)

0     apple
1    orange
0     apple
0     apple
0     apple
1    orange
0     apple
0     apple
dtype: object

Categorical Extension Type in Pandas

In [207]:
fruits = ['apple','orange','apple','apple'] * 2
fruits

['apple', 'orange', 'apple', 'apple', 'apple', 'orange', 'apple', 'apple']

In [208]:
N = len(fruits)

In [209]:
rng = np.random.default_rng(seed=12345)

In [212]:
df = pd.DataFrame({'fruit' : fruits,
                   'basket_id' : np.arange(N),
                   'count' : rng.integers(3,15,size =N),
                   'weight' : rng.uniform(0,4,size=N)},
                  columns = ['basket_id','fruit','count','weight'])

In [213]:
df

   basket_id   fruit  count    weight
0          0   apple     11  2.789814
1          1  orange     11  1.305891
2          2   apple      4  2.935713
3          3   apple      4  0.880540
4          4   apple      6  0.326378
5          5  orange      8  0.639582
6          6   apple      3  1.360401
7          7   apple     13  1.860773

In [214]:
fruit_cat = df['fruit'].astype('category')

In [215]:
fruit_cat

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

In [216]:
c = fruit_cat.array

In [217]:
type(c)

pandas.core.arrays.categorical.Categorical

In [218]:
c.categories

Index(['apple', 'orange'], dtype='object')

In [219]:
c.codes

array([0, 1, 0, 0, 0, 1, 0, 0], dtype=int8)

In [220]:
dict(enumerate(c.categories))

{0: 'apple', 1: 'orange'}

In [221]:
df['fruit'] = df['fruit'].astype('category')

In [222]:
df['fruit']

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

In [223]:
my_categories = pd.Categorical(['foo','bar','baz','foo','bar'])

In [224]:
my_categories

['foo', 'bar', 'baz', 'foo', 'bar']
Categories (3, object): ['bar', 'baz', 'foo']

In [225]:
my_categories.codes

array([2, 0, 1, 2, 0], dtype=int8)

In [226]:
categories = ['foo','bar','baz']

In [227]:
codes = [0,1,2,0,0,1]

In [228]:
my_cats_2 = pd.Categorical.from_codes(codes,categories)

In [229]:
my_cats_2

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo', 'bar', 'baz']

In [231]:
ordered_cat = pd.Categorical.from_codes(codes, categories, ordered = True)

In [232]:
ordered_cat

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo' < 'bar' < 'baz']

In [234]:
my_cats_2.as_ordered()

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo' < 'bar' < 'baz']

Computation with categories

In [235]:
rng = np.random.default_rng(seed = 12345)

In [236]:
draws = rng.standard_normal(1000)

In [237]:
draws

array([-1.42382504e+00,  1.26372846e+00, -8.70661738e-01, -2.59173235e-01,
       -7.53433070e-02, -7.40884652e-01, -1.36779270e+00,  6.48892802e-01,
        3.61058113e-01, -1.95286306e+00,  2.34740965e+00,  9.68496906e-01,
       -7.59387180e-01,  9.02198274e-01, -4.66953173e-01, -6.06895187e-02,
        7.88844345e-01, -1.25666813e+00,  5.75857514e-01,  1.39897899e+00,
        1.32229806e+00, -2.99698515e-01,  9.02919341e-01, -1.62158273e+00,
       -1.58189261e-01,  4.49483932e-01, -1.34360107e+00, -8.16875907e-02,
        1.72473993e+00,  2.61815943e+00,  7.77361344e-01,  8.28633196e-01,
       -9.58988313e-01, -1.20938829e+00, -1.41229201e+00,  5.41546830e-01,
        7.51939396e-01, -6.58760320e-01, -1.22867499e+00,  2.57557768e-01,
        3.12902918e-01, -1.30811690e-01,  1.26998312e+00, -9.29624577e-02,
       -6.61508890e-02, -1.10821447e+00,  1.35956851e-01,  1.34707776e+00,
        6.11440210e-02,  7.09146003e-02,  4.33654537e-01,  2.77483660e-01,
        5.30252387e-01,  5.36720969e-01,  6.18350015e-01, -7.95017456e-01,
        3.00030946e-01, -1.60270159e+00,  2.66798830e-01, -1.26162378e+00,
       -7.12708062e-02,  4.74049730e-01, -4.14853761e-01,  9.77165000e-02,
       -1.64041784e+00, -8.57258824e-01,  6.88281788e-01, -1.15452958e+00,
        6.50452389e-01, -1.38835995e+00, -9.07382457e-01, -1.09542531e+00,
        7.14569494e-03,  5.34359903e-01, -1.06580785e+00, -1.81472740e-01,
        1.62195180e+00, -3.17391946e-01, -8.15814967e-01,  3.86579017e-01,
       -2.23638926e-01, -7.01690809e-01, -1.79571318e+00,  8.18325622e-01,
       -5.71032902e-01,  7.85525063e-04, -1.06364272e+00,  1.30171450e+00,
        7.47872942e-01,  9.80875909e-01, -1.10418688e-01,  4.67918531e-01,
        8.90607150e-01,  1.02300937e+00,  3.12383389e-01, -6.19046857e-02,
       -3.59479647e-01, -7.48643984e-01, -9.65478907e-01,  3.60034657e-01,
       -2.44552532e-01, -1.99585661e+00, -1.55247617e-01,  1.06383087e+00,
       -2.75171567e-01, -1.85333593e+00, -1.24341928e-01,  7.84974522e-01,
        2.01998597e-01, -4.28074443e-01,  1.84828890e+00,  1.89995289e+00,
       -9.84250348e-02,  8.13445440e-01,  3.92494389e-01,  7.81442900e-01,
        1.45327152e+00,  8.20186045e-01,  8.77053446e-02, -6.53505648e-01,
       -8.11886879e-01, -2.55381724e-02,  1.15818454e+00,  3.00520870e-01,
        5.30566461e-02,  2.57271524e-01,  3.57428624e-02,  5.47236686e-01,
       -1.12296158e+00, -1.97524767e+00, -4.25150050e-01, -1.14907382e+00,
        1.61513805e+00, -1.58476860e-01, -2.52873345e-01, -1.53815403e+00,
        2.82086033e-01, -6.23612134e-01,  1.12182226e+00,  8.41221031e-01,
       -7.75896101e-01,  4.10716440e-01, -2.72241610e+00, -6.73304799e-01,
        1.24622153e+00,  7.90208028e-01,  1.75340888e-01, -2.92946016e-02,
       -1.41951426e+00, -1.35996632e+00,  2.23411559e-01,  1.76177943e+00,
       -2.17088985e+00,  6.28488171e-01,  6.01196526e-01,  9.50757858e-01,
       -8.69246667e-01, -5.29007071e-01,  4.56840956e-02, -1.02755181e+00,
       -1.22928930e+00, -8.83358472e-01, -7.08934637e-02,  3.74053351e-01,
       -2.45937384e-02,  7.72606583e-02, -6.83913218e-01, -7.20837668e-01,
        1.12062282e+00, -5.48141603e-02, -8.24137242e-02,  9.35986501e-01,
        1.23853712e+00,  1.27279553e+00,  4.05892218e-01, -5.03252214e-02,
        2.89317539e-01,  1.79305677e-01,  1.39748056e+00,  2.92046792e-01,
        6.38405674e-01, -2.78877131e-02,  1.37105185e+00, -2.05280763e+00,
        3.80509078e-01,  7.55390669e-01, -1.15912585e+00,  2.15031011e+00,
       -1.50270219e-01, -1.61164280e-01, -1.07944248e+00,  8.77966184e-01,
        2.24467414e-01, -5.91593454e-01,  2.26262802e-01,  6.86182507e-01,
        1.21500461e+00,  2.16059441e-01, -9.64823557e-01, -5.56607805e-01,
       -2.29838764e+00, -7.32082126e-01,  7.36469100e-01,  4.65716719e-01,
       -1.07876049e-01, -3.41436294e-01,  1.58453379e+00,  2.82241206e-01,
        9.09546391e-01,  3.95071566e-01, -6.69376519e-01,  1.55536898e+00,
       -1.23813903e+00, -1.19617346e+00, -4.29149506e-01, -7.29659893e-01,
       -5.57468899e-01, -5.99953064e-01,  9.86827204e-01,  5.41946751e-02,
        3.51907443e-01, -1.58796951e+00, -8.46951349e-01,  1.08457026e+00,
       -1.20382665e+00,  1.17853089e+00, -1.03066585e+00,  2.99218328e-01,
       -8.46239971e-01,  1.96620300e-01, -8.99637825e-01, -2.56605429e-01,
        1.67254777e+00, -3.75269646e-01,  2.03679478e+00, -4.58793398e-01,
       -1.17576966e+00,  7.50524988e-02, -4.08990215e-01,  1.75653198e+00,
        8.60923069e-01,  1.18127398e+00,  6.31670171e-01,  2.47099711e+00,
        7.94302517e-01,  5.31352878e-01, -8.29398597e-01, -9.09303834e-01,
        1.84235934e-01,  9.97738175e-01,  1.11695904e+00, -9.44000541e-01,
        5.31406704e-01,  1.93345997e-01, -1.11826358e+00,  5.11845582e-01,
       -2.27056629e+00,  2.63163546e-01,  2.47131349e+00, -1.01988520e+00,
        1.87526150e-02, -1.89426422e+00, -7.55001656e-01,  7.56197740e-01,
       -1.04246201e+00, -3.42581430e-02, -3.55168299e-01, -3.78428368e-01,
        1.90648688e-01,  4.84396294e-01,  1.23026775e+00,  8.32970623e-01,
       -5.64941752e-01,  1.41469601e+00,  1.24828122e+00, -1.55894810e+00,
        6.65232592e-01,  8.25595172e-01,  9.66318833e-01,  5.47175299e-01,
       -1.29718326e+00, -2.67634333e-01, -2.07020656e+00, -1.57892554e-01,
        2.02894262e+00,  6.81570885e-01,  8.36203582e-01, -5.13488047e-01,
       -1.01573661e+00, -1.07027090e+00,  1.23912658e-01, -8.03015882e-01,
       -6.37635747e-01,  1.14449564e+00, -1.64090191e+00, -1.31400358e+00,
       -5.10352510e-01, -9.98608839e-02, -1.29506764e-01, -1.39670506e+00,
        1.93809351e-01, -1.29292728e-01,  3.54479094e-01, -1.08287264e+00,
        2.44939235e-01,  2.20820791e-01, -6.60432484e-01, -2.18535151e-01,
       -5.55999012e-01,  1.35638101e+00, -3.11960863e+00, -1.44767170e+00,
       -1.70578539e+00, -3.78119923e-01, -6.78493916e-01, -4.11245934e-01,
        7.19012644e-01, -1.63251948e+00, -8.45693631e-01, -2.23100058e-01,
       -1.20221832e+00,  3.69987683e-01,  3.29997358e-01, -7.10446611e-01,
       -1.77110716e+00,  1.60083585e+00,  4.71098065e-01,  4.23750625e-01,
        7.22604814e-02, -7.34696662e-03,  8.31075673e-01, -1.56055249e-02,
       -6.30906338e-01,  7.09501385e-01,  5.96951708e-02, -7.72475747e-01,
       -9.06239094e-01,  1.16547928e+00,  6.31047402e-01,  1.97551858e+00,
       -5.26655196e-01, -7.43540587e-01,  4.03890571e-01,  1.37940685e+00,
        5.96752401e-01,  4.33153072e-01,  1.88698807e+00, -7.43390939e-01,
       -1.24794902e+00, -7.44618316e-01, -3.16856989e-01,  3.73351314e-01,
        1.02196035e+00,  4.05609723e-01,  1.52331375e+00, -8.27508128e-01,
        1.90549546e+00, -8.12021693e-01,  1.17073624e+00, -9.37842967e-01,
        3.43267007e-01,  5.08984102e-02,  5.17559645e-01,  7.51424764e-01,
       -2.13199171e-01, -6.68236776e-02,  2.39111718e-01, -1.30500814e+00,
       -7.31236440e-01, -1.62440684e+00,  5.25050962e-03,  2.22215696e+00,
        7.41309224e-01, -8.65429707e-01, -7.07684696e-01,  9.75898764e-01,
       -4.74409383e-01, -1.60848203e+00, -1.02291555e+00, -1.05425642e+00,
       -1.02139871e+00,  6.75950820e-01,  7.07028719e-02, -1.48863945e+00,
       -5.39796993e-01, -1.13832102e+00, -1.20842052e+00, -1.50667492e+00,
        1.74716204e+00, -3.07329521e-01,  5.76230584e-01,  8.68743678e-01,
       -3.84271666e-01,  5.34919539e-01,  5.40615879e-01,  2.22456521e-01,
        2.16953213e+00,  2.83928102e-01, -2.28490514e-01,  6.46164480e-01,
        1.77796354e+00,  9.94308000e-01, -4.78299892e-01, -8.58764574e-01,
       -9.30850286e-01, -6.61899356e-01,  3.86500903e-01,  8.45988292e-01,
       -2.26994787e+00, -1.86681654e-02, -1.10501888e+00,  6.82899732e-01,
        9.14518493e-01, -7.78352115e-01, -4.49423204e-01, -9.51618630e-01,
        3.91078535e-01, -1.60996181e+00, -1.12557525e+00, -6.84623837e-01,
        1.22651896e+00,  2.40247280e+00,  1.99584190e-02, -1.23157125e+00,
        7.41864685e-02, -8.69049593e-01,  4.59819568e-01, -1.11370451e+00,
       -3.69487350e-01, -1.41055279e-02,  5.19943798e-01, -7.68884933e-02,
        1.26588858e+00,  1.24232762e-01, -1.81381491e+00,  9.24059031e-01,
       -2.91113406e-01, -6.69762242e-01,  1.50768468e+00, -9.93606188e-01,
        7.26674371e-02, -7.12974484e-01,  1.35242893e+00, -3.64017286e-01,
        2.35699478e-01, -1.39228465e+00,  1.43473399e+00, -1.06952042e+00,
        9.10459323e-01,  1.11370559e+00,  1.23231538e+00,  1.81411281e+00,
       -1.17073802e+00,  4.01982178e-01,  1.37969649e-01,  4.19915493e-01,
        1.09831954e+00,  1.09361768e-01, -8.16919212e-01, -9.72529682e-02,
        1.53923643e+00, -1.17898747e+00,  7.96842462e-02, -9.81300666e-01,
        1.10877941e+00, -1.64844862e+00, -3.41086469e-01, -1.24194966e-01,
        1.16915739e-01,  2.36121870e+00,  1.55516878e+00, -1.02985940e+00,
        2.15940445e+00, -1.19253343e+00, -1.87089050e+00, -1.49848205e+00,
        2.03450471e-01,  5.34860586e-01, -2.21108587e+00,  4.35974191e-01,
       -2.67052169e-01,  7.06389532e-01, -3.84606815e-01,  9.00081711e-01,
        5.64345130e-01, -1.17264499e+00,  1.44559200e+00,  2.12427128e-01,
        7.30048821e-01,  1.26177194e+00, -9.74758332e-01, -8.47372106e-02,
       -8.21697969e-01, -9.42372732e-01,  2.65979546e-01,  3.39791108e-01,
        1.33140349e+00,  1.38554064e+00, -2.13583034e-02, -8.37064726e-01,
        3.20068942e+00,  2.14788244e+00, -1.06664772e-01, -9.30154944e-01,
       -4.23674369e-01,  2.80961046e-01,  1.13155122e+00,  9.69383232e-01,
        4.35415205e-01, -2.47125731e-01,  1.68185205e-01, -3.10624535e-01,
        7.09335975e-02, -1.03372303e-01,  5.25325277e-01, -1.88267705e+00,
       -3.45678008e-01, -2.91309198e-01, -1.13063834e+00, -1.72724675e-01,
       -1.05354233e+00, -6.64553142e-01, -2.89681998e-01, -2.53171766e-01,
       -5.73783158e-01,  1.10347462e+00,  2.01165087e-01,  3.22351424e-01,
        2.33092758e-01, -6.68065235e-01, -8.83219013e-01,  8.39639691e-01,
       -3.53077897e-01, -1.77113747e+00, -2.19878710e+00,  2.21760184e-01,
       -7.37077207e-01, -6.75838533e-02, -5.47254160e-01, -4.07414631e-01,
       -1.72737620e-01, -1.24740736e+00, -1.87624193e-02,  9.86123587e-01,
        6.95674273e-01, -1.73962463e+00, -1.34163608e+00, -1.33282638e+00,
       -2.48068818e-01,  8.54834793e-01,  3.22984340e-01, -1.75364283e+00,
        5.48855340e-02,  8.07411591e-01, -4.49013978e-01,  1.90417969e+00,
       -6.51468305e-01,  1.17248231e+00,  2.35122688e+00, -1.27642360e+00,
       -3.23686621e-01,  5.74696204e-01,  3.21141765e+00, -1.78846554e+00,
        5.66050226e-01,  2.84796348e-01, -4.22376126e-01, -8.34852439e-01,
       -5.25916185e-01, -3.03053674e-01, -1.26985950e+00,  1.57548510e+00,
       -1.10845010e+00, -4.27519357e-01, -6.61481082e-01, -4.13253934e-01,
        9.29779267e-02, -7.57597067e-01, -2.36129912e-01,  1.72446043e+00,
        1.05620035e+00, -2.88028999e-01,  9.07177602e-01, -7.68494068e-01,
        2.25931240e-01, -1.42854248e+00, -1.14411867e+00, -8.66556389e-01,
        1.23753573e+00,  2.30691366e-01,  5.47763034e-01,  1.51652927e-01,
        3.66900043e-01,  4.19478919e-01,  7.65321189e-01,  1.61256679e-01,
       -9.16034823e-01, -7.90918993e-01,  1.21417311e+00,  1.41180344e+00,
        5.59364429e-01, -1.64489871e+00,  1.57517058e+00,  3.22935600e-01,
       -7.45220037e-02,  1.96548842e-02, -3.72683645e-01,  1.75834442e+00,
        1.68263067e+00, -1.06481789e+00, -1.89796109e-01,  3.03403443e-01,
        1.27573152e+00, -2.42960165e+00,  9.30610015e-01,  1.66783860e+00,
       -3.34090032e-01, -5.15106149e-02,  1.24325830e+00,  3.67036430e-01,
       -1.34618662e+00, -1.18188225e+00, -1.04500481e+00, -1.43236727e+00,
       -2.00886227e-02, -5.34166690e-01,  2.68754533e-02,  6.92732323e-01,
        1.77458224e+00,  2.02141113e-01, -1.88084695e+00,  1.37878553e+00,
       -1.33647093e-01,  1.15171173e+00, -4.66425062e-01,  2.88564390e-01,
       -1.51156922e-01, -4.21025412e-02,  1.26211915e+00, -6.72702969e-01,
        1.47547470e-01,  2.03816429e-01, -4.06218846e-01, -2.22197231e+00,
        3.31811656e-01, -2.86054756e+00, -1.52344944e+00, -4.77970317e-01,
        4.12657231e-01,  8.46392900e-01,  8.12101895e-01,  5.80603328e-01,
       -3.81073120e-01,  1.20099431e+00, -2.83772779e-01,  1.10710475e+00,
       -2.25610096e+00, -9.71854993e-01, -5.92905332e-01, -1.80984888e-02,
       -2.41274891e+00,  7.99226280e-01,  9.76130692e-01,  7.73092119e-01,
       -5.33216690e-01,  1.44149015e+00, -5.63981533e-01,  8.93470827e-01,
       -7.42512680e-02, -3.46069864e-02, -1.70816032e-01, -3.65517036e-02,
        1.09806562e+00,  1.42629484e+00,  1.41467983e+00,  8.94438213e-01,
        6.53670700e-01,  4.37152200e-01,  1.74635813e+00, -4.57095959e-01,
       -6.49308823e-01,  3.29631178e-02, -1.68504146e+00, -2.52598256e-01,
       -7.40313034e-02, -1.04422943e+00, -5.92776806e-01,  6.80170674e-01,
       -2.45973193e-01,  6.05624791e-02,  1.01972358e+00, -6.30050546e-01,
       -1.16037758e+00, -5.68747898e-02,  4.09270722e-01, -1.82967470e+00,
        6.41954142e-01, -3.29663996e-01, -4.29324018e-01, -8.76878553e-01,
       -1.99605506e-01,  9.50270920e-01,  5.13872750e-01,  7.97806039e-01,
       -3.78129354e-01,  1.58223187e+00,  1.26565747e+00, -2.97258104e-02,
       -2.63975939e+00,  5.11408937e-02,  2.74776943e+00, -6.41340596e-02,
       -1.03022593e+00,  1.69910136e+00, -6.23692147e-01,  4.87480901e-01,
        7.59003689e-01, -1.47967223e+00,  1.21195076e-01,  1.18862963e+00,
       -3.33439437e-01,  6.49091238e-01, -2.68320151e-02,  1.02504738e+00,
        1.84822504e+00, -1.10302841e+00, -2.90388788e-01,  3.91568101e-01,
       -6.35179488e-01, -8.30046051e-01, -3.49766369e-01, -2.73043102e-01,
       -6.57943966e-01,  3.26871488e-01,  8.06477506e-01,  7.45273260e-01,
        6.79356544e-01,  1.19250597e+00, -1.36682791e+00, -1.16610196e-01,
        1.89020240e-01,  5.25771351e-01, -1.61611005e+00,  1.88072206e+00,
       -8.90609769e-01,  2.64065068e-01,  7.37306312e-01,  1.08683733e+00,
       -6.86425763e-01, -5.41809934e-01,  3.71199796e-01,  5.87459116e-01,
        9.12199847e-01, -5.58262834e-02, -6.93849578e-01, -1.33469428e+00,
        1.74643808e+00, -1.37337178e+00,  7.01209730e-01,  2.80065839e-01,
        7.64387370e-01,  9.56512535e-01,  1.35260228e+00, -5.57675673e-02,
        4.00128333e-01, -1.95141827e+00,  4.87654583e-02, -9.04456538e-01,
       -1.50266126e-01,  1.24142710e+00,  1.10711736e-01,  1.09518667e+00,
       -1.96699537e-01,  4.04457880e-01, -4.08996512e-01, -2.54134859e+00,
       -7.09034551e-01, -2.61584450e-01,  1.62631878e-01,  8.00948081e-03,
       -1.20706299e-01,  9.54237782e-01,  6.31583051e-01, -3.91507141e-01,
        8.78542722e-01, -1.97955644e+00, -2.75772309e-01, -1.40276139e-01,
        1.31070480e+00, -5.28500651e-01, -1.46383938e+00,  1.85654973e-01,
        1.70252885e+00, -1.99544374e-01, -8.88567225e-02, -1.94608586e-01,
        6.27299579e-02,  1.31431080e+00,  1.97533222e+00,  4.83255311e-01,
       -9.18163044e-02,  1.86629965e+00,  1.12426883e-01,  7.96155755e-02,
       -3.43781159e-01, -3.01186339e-01,  2.55405106e-01, -2.72675415e-01,
        4.33152856e-01,  1.07167979e-01,  5.71301488e-01, -3.65811143e-01,
       -1.84096983e-01,  2.59634677e-01,  8.44739669e-02,  1.16225041e-01,
        1.18618327e+00, -1.05588866e+00, -1.92531911e+00,  7.41063995e-01,
       -2.25619867e-01,  1.36557115e+00, -6.91680767e-02, -1.15299609e+00,
        2.20967326e+00,  4.16474443e-01, -4.36370065e-01, -7.36003886e-01,
        5.77436642e-01, -6.61492763e-01,  4.04745377e-01,  1.17892344e+00,
       -1.37460854e+00, -3.42269285e-01,  4.93190798e-01,  1.67419420e+00,
        9.43233691e-01, -4.41555599e-01,  1.47481586e+00, -3.45749659e-01,
       -1.50040126e-01,  3.89896938e-01, -1.08308193e+00,  3.08547984e+00,
        1.20884340e+00,  2.30186339e-01, -5.57802141e-01, -1.14851471e+00,
        3.81971017e-01,  7.04365602e-01, -3.88899963e-01, -1.85506898e-01,
        5.66330561e-01, -5.14316746e-02, -1.84623690e+00,  6.74638603e-01,
        2.52036725e-01,  7.38055640e-01, -7.47455035e-01, -2.11733639e+00,
       -1.24066567e+00,  3.05211001e-01,  2.08559027e+00,  2.35953985e+00,
        3.09501519e-01, -1.45127282e+00, -3.30059784e-01,  4.52826884e-01,
        4.42335688e-01,  1.00453644e-01,  1.34452292e+00, -8.93585852e-01,
       -2.16067912e+00, -8.72209569e-01, -1.15675951e+00,  2.23833940e+00,
       -1.81078344e-01, -1.42330841e+00,  6.21797411e-01,  1.01150219e+00,
        5.80898468e-02,  1.97413065e-01,  1.02838433e+00,  5.19340217e-01,
       -6.95040014e-01,  5.93706415e-01,  9.33222659e-01,  3.46441675e-01,
        8.77310301e-01,  5.88943854e-01, -2.32237743e-01, -1.42786369e-01,
        6.17561542e-01, -5.49857188e-01,  1.15527732e+00,  1.22211314e+00,
       -2.02892326e+00, -6.67985788e-02, -7.47957405e-01, -6.31399197e-01,
        1.47630647e-01, -1.66716028e-01,  5.67283300e-01,  3.23970679e-01,
        3.72784476e-01, -7.80923775e-01, -3.46318386e-01,  1.46062736e+00,
       -2.47755133e+00,  1.71945608e+00, -5.59273509e-01,  1.18097398e+00,
       -2.59346818e+00, -4.17242207e-01,  8.49845257e-01,  1.51235852e-01,
        1.01700015e+00, -8.73684243e-01, -5.58382387e-01, -6.52810234e-01,
        5.08683548e-01,  4.63572064e-01, -1.21482075e-01, -2.62915619e-01,
       -2.90783934e-01,  8.81631845e-02, -9.47190487e-01, -5.57949240e-02,
       -1.42628014e-01, -5.38803680e-01, -5.68810617e-01,  1.47837068e+00,
       -6.13257840e-01,  4.13189600e-01,  1.36901951e+00,  7.41449461e-01,
        2.12223314e-02,  1.01479931e+00, -1.42454369e+00, -1.22979084e+00,
       -3.95445015e-01, -2.19221836e-01, -9.46068703e-02,  1.88075025e+00,
        1.68899606e+00, -3.71186734e-02,  2.56070265e-01, -9.06325704e-01,
        3.19810330e-01, -1.34149193e+00,  1.40031595e+00, -5.18227724e-01,
        5.58352650e-01, -1.30547512e+00,  1.39204144e+00,  6.12108552e-01,
        1.96032218e+00,  6.88082154e-02, -1.61927444e+00, -7.83655538e-01,
       -1.25498393e+00,  1.57890107e+00, -6.24035140e-01, -7.52088547e-01,
        5.96104190e-01,  2.66923552e-01,  4.93312599e-01, -5.01478344e-01,
       -1.99770485e+00, -1.35874699e+00, -2.19554107e+00,  1.28115129e+00,
        9.10711662e-01, -3.73667225e-01,  6.24494021e-01,  6.74017103e-01,
        6.37016040e-01,  5.32955071e-01,  8.84989640e-01,  8.31998074e-02,
       -2.21975447e+00, -2.76714798e+00,  1.26613253e+00,  5.98509237e-01,
       -2.51309108e+00,  1.75597388e-01, -8.77888581e-01, -5.47070340e-01,
       -2.60357335e+00,  7.73042027e-01, -8.33765144e-02,  8.18447261e-01,
        1.09093020e+00,  1.29142947e+00,  1.65147111e+00,  2.93889928e-01,
        2.19100411e-01, -6.37850133e-01,  5.30894232e-01, -2.37211561e-01])

In [238]:
draws[:5]

array([-1.42382504,  1.26372846, -0.87066174, -0.25917323, -0.07534331])

In [239]:
bins = pd.qcut(draws,4)

In [240]:
bins

[(-3.121, -0.675], (0.687, 3.211], (-3.121, -0.675], (-0.675, 0.0134], (-0.675, 0.0134], ..., (0.0134, 0.687], (0.0134, 0.687], (-0.675, 0.0134], (0.0134, 0.687], (-0.675, 0.0134]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.121, -0.675] < (-0.675, 0.0134] < (0.0134, 0.687] < (0.687, 3.211]]

In [241]:
bins = pd.qcut(draws,4,labels = ['Q1','Q2','Q3','Q4'])

In [242]:
bins

['Q1', 'Q4', 'Q1', 'Q2', 'Q2', ..., 'Q3', 'Q3', 'Q2', 'Q3', 'Q2']
Length: 1000
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [243]:
bins.codes[:10]

array([0, 3, 0, 1, 1, 0, 0, 2, 2, 0], dtype=int8)

In [244]:
bins = pd.Series(bins, name = 'quartile')

In [245]:
results = (pd.Series(draws).groupby(bins).agg(['count','min','max']).reset_index())

C:\Users\User\AppData\Local\Temp\ipykernel_2776\1051773774.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  results = (pd.Series(draws).groupby(bins).agg(['count','min','max']).reset_index())

In [247]:
results

  quartile  count       min       max
0       Q1    250 -3.119609 -0.678494
1       Q2    250 -0.673305  0.008009
2       Q3    250  0.018753  0.686183
3       Q4    250  0.688282  3.211418

In [248]:
results.quartile

0    Q1
1    Q2
2    Q3
3    Q4
Name: quartile, dtype: category
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [249]:
N = 10_000_000

In [250]:
labels = pd.Series(['foo','bar','baz','qux']*(N//4))

In [251]:
labels

0          foo
1          bar
2          baz
3          qux
4          foo
          ...
9999995    qux
9999996    foo
9999997    bar
9999998    baz
9999999    qux
Length: 10000000, dtype: object

In [252]:
categories = labels.astype('category')

In [254]:
# memory
labels.memory_usage(deep= True)

520000132

In [255]:
categories.memory_usage(deep= True)

10000512

Categorical Method

In [256]:
s = pd.Series(['a','b','c','d']*2)

In [257]:
cat_s = s.astype('category')

In [258]:
cat_s

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [259]:
cat_s.cat.codes

0    0
1    1
2    2
3    3
4    0
5    1
6    2
7    3
dtype: int8

In [260]:
cat_s.cat.categories

Index(['a', 'b', 'c', 'd'], dtype='object')

In [261]:
actual_categories = ['a','b','c','d','e']

In [262]:
cat_s2 = cat_s.cat.set_categories(actual_categories)

In [263]:
cat_s2

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (5, object): ['a', 'b', 'c', 'd', 'e']

In [265]:
cat_s.value_counts()

a    2
b    2
c    2
d    2
Name: count, dtype: int64

In [266]:
cat_s2.value_counts()

a    2
b    2
c    2
d    2
e    0
Name: count, dtype: int64

In [267]:
# removing unused categories
cat_s3 = cat_s[cat_s.isin(['a','b'])]

In [268]:
cat_s3

0    a
1    b
4    a
5    b
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [270]:
cat_s3.cat.remove_unused_categories()

0    a
1    b
4    a
5    b
dtype: category
Categories (2, object): ['a', 'b']

In [271]:
cat_s

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [273]:
cat_s.cat.add_categories('e')

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (5, object): ['a', 'b', 'c', 'd', 'e']

In [274]:
cat_s.cat.as_ordered()

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (4, object): ['a' < 'b' < 'c' < 'd']

In [276]:
cat_s.cat.as_unordered()

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [279]:
cat_s.cat.rename_categories(['a','f','e','g'])

0    a
1    f
2    e
3    g
4    a
5    f
6    e
7    g
dtype: category
Categories (4, object): ['a', 'f', 'e', 'g']

Create a dummy variables for modeling

In [280]:
cat_s = pd.Series(['a','b','c','d']*2 , dtype = 'category')

In [282]:
cat_s

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [283]:
cat_s.cat.codes

0    0
1    1
2    2
3    3
4    0
5    1
6    2
7    3
dtype: int8

In [284]:
cat_s.value_counts()

a    2
b    2
c    2
d    2
Name: count, dtype: int64

In [286]:
# getting dummies
pd.get_dummies(cat_s)

       a      b      c      d
0   True  False  False  False
1  False   True  False  False
2  False  False   True  False
3  False  False  False   True
4   True  False  False  False
5  False   True  False  False
6  False  False   True  False
7  False  False  False   True

In [288]:
movies = pd.read_table(r"D:\PythonForDataAnalysis\movies.dat",sep ="::", header = None, names = mnames, engine ="python")

In [289]:
movies.head()

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

In [292]:
movie_genres = movies.genres.str.get_dummies("|")

In [293]:
movie_genres

,Action,Adventure,Animation,Children's,Comedy,Crime,Documentary,Drama,Fantasy,Film-Noir,Horror,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,0,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0
1,0,1,0,1,0,0,0,0,1,0,0,0,0,0,0,0,0,0
2,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0
3,0,0,0,0,1,0,0,1,0,0,0,0,0,0,0,0,0,0
4,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0
3879,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0
3880,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0
3881,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0
3882,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0

In [296]:
movie_genres.head()

,Action,Adventure,Animation,Children's,Comedy,Crime,Documentary,Drama,Fantasy,Film-Noir,Horror,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,0,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0
1,0,1,0,1,0,0,0,0,1,0,0,0,0,0,0,0,0,0
2,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0
3,0,0,0,0,1,0,0,1,0,0,0,0,0,0,0,0,0,0
4,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0

In [297]:
movies.head()

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

In [299]:
movie_genres.join(dummies.add_prefix("Genres_"))

,Action,Adventure,Animation,Children's,Comedy,Crime,Documentary,Drama,Fantasy,Film-Noir,...,Genres_Fantasy,Genres_Film-Noir,Genres_Horror,Genres_Musical,Genres_Mystery,Genres_Romance,Genres_Sci-Fi,Genres_Thriller,Genres_War,Genres_Western
0,0,0,1,1,1,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,0,1,0,1,0,0,0,0,1,0,...,1,0,0,0,0,0,0,0,0,0
2,0,0,0,0,1,0,0,0,0,0,...,0,0,0,0,0,1,0,0,0,0
3,0,0,0,0,1,0,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0
4,0,0,0,0,1,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0,0,0,0,1,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3879,0,0,0,0,0,0,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0
3880,0,0,0,0,0,0,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0
3881,0,0,0,0,0,0,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0
3882,0,0,0,0,0,0,0,1,0,0,...,0,0,0,0,0,0,0,1,0,0

In [302]:
movie_genres.iloc[1]

Action         0
Adventure      1
Animation      0
Children's     1
Comedy         0
Crime          0
Documentary    0
Drama          0
Fantasy        1
Film-Noir      0
Horror         0
Musical        0
Mystery        0
Romance        0
Sci-Fi         0
Thriller       0
War            0
Western        0
Name: 1, dtype: int64